#include <iostream>

using namespace std;
int main() {
	setlocale(LC_ALL, "Russian");
	int n, m, sum;
			//Игра "Угадайка"
	/*cout << "Давай сыграем в \"Угадайку\"!\n";
	cout << "Я загадал число от 1 до 1. Попробуй угадать его!" << "\n";
	int magicNum = 7;
	for (int i = 0; i < 5; i++) {
		cout << "Попытка номер " << i + 1 << ". Введи число -> ";
		cin >> n;
		if (n == magicNum) {
			cout << "Отлично, ты угадал!" << "\n\n";
			break;												//команда break заканчивает итеррацию! после break цикл заканчивается.
		}
		cout << "Нет, я загадал не это число." << "\n";
		if (i == 4) {
			cout << "Ты так и не смог угадать число!" << "\n\n";
		}
	}*/

			//Задача 1
	/*cout << "задача 1\nВведите 1 число:";
	int max;
	cin >> max;
	for (int i = 1; i < 10; i++) {
		cout << "Введите " << i + 1 << " число:";
		cin >> n;
		if (n > max)
			max = n;
	}
	cout << "Максимум = " << max << "\n\n";*/

			//Задача 2
	/*cout << "задача 2\n";
	sum = 0;				//Инициализация обязательна!!!
	for (int i = 0; i < 10; i++) {
		cout << "Введите " << i + 1 << " число: ";
		cin >> n;
		//if (n % 5 == 0) //вариант 1
		//	continue;
		//sum += n;
		//if (n % 5 != 0) //вариант 2
			sum += n;
		if (n % 5)		  //вариант 3
			sum += n;
	}
	cout << "Сумма чисел не кратных пяти = " << sum << "\n\n";*/

			//Задача 3
	/*cout << "Задача 3\nВведите начало диапазона: ";
	cin >> n;
	cout << "Введите конец диапазона: ";
	cin >> m;
	for (int i = m; i >= n; i -= 2) {		//Перебираем числа от большего к меньшему
		cout << i << ", ";
	}
	cout << "\b\b.\n\n";*/

			//Задача 4
	/*cout << "Задача 4\nВведите число: ";
	cin >> n;
	cout << "Делители числа: ";
	for (int i = 1; i <= n / 2; i++) {
		if (n % i == 0)
			cout << i << ", ";
	}
		cout << n << ".\n\n";*/

			//Задача 5. Способ 1.
	/*cout << "Задача 5\nВведите число: ";		// плохой способ. Попроще, но программа работать будет дольше.
	cin >> n;
	int count = 0;
	for (int i = 1; i <= n; i++)
		if (n % i == 0)
			count++;
	if (count == 2)
		cout << "Число " << n << " Простое." << "\n\n";
	else 
		cout << "Число " << n << " не простое." << "\n\n";*/

			//Задача 5 Способ 2
	/*cout << "Задача 5\nВведите число: ";		//лучший вариант для производительности!
	cin >> n;
	if (n == 1)
		cout << "Число 1 не простое." << "\n\n";
	if (n == 2 || n == 3)
		cout << "число " << n << " простое." << "\n\n";
	else
		for (int i = 2; i <= n / 2; i++) {
			if (n % i == 0) {
				cout << "Число " << n << " не простое." << "\n\n";
				break;
		}
		if (i == n / 2)
			cout << "Число " << n << " простое." << "\n\n";
	}*/

	return 0;
}