// Ёто коментарий. ќн используетс€ дл€ создани€ заметок дл€ програмиста, 
//а так же он игнорируетс€ программой. дл€ написани€ коментари€ используетс€//
/*Ёто многострочный коментарий он используетс€ дл€ создани€ коментари€ длинною в несколько строк
. “ак же он используетс€ дл€ того, что бы быстрее закоментировать часть кода. 
*/
#include <iostream>//это подключение библиотеки iostream с помощью команды include.
//ƒанна€ команда должна присутствовать в каждой программе.

using namespace std;//¬ данной сторке мы подключили пространство имЄн std, который содержит в себе команду cout
int main() { // создаЄм основной метод main, — которого будет запускатьс€ весь проект.
//
	cout << "Hello World!";// — помощью команды cout мы можем выводить в консоль любу информацию. ≈сли мы хотим выводить...
	return 0;// — помощью данной команды мы показали, что завершаем выполнени€ метода main. ƒл€ данного метода мы задаЄм код 0
}// фигурные скобки включают в себ€ тело метода main. ≈сли скобку мы однажды открываем, в будущем мы об€заны ее закрыть.
